package command

func EnCommandLanguage() string {
	return `
🔤 <b>You can change the bot's interface language.</b>
Please choose the language you’d like the bot to use when talking to you.`
}

func UkCommandLanguage() string {
	return `
🔤 <b>Ви можете змінити мову інтерфейсу бота.</b>
Будь ласка, оберіть мову, якою бот буде з вами спілкуватися.

📝 <i>Зверніть увагу: сайт <a href="https://www.vsch.org">vsch.org</a> не підтримує українську мову, тому назви церков відображаються російською.</i>
`
}

func RuCommandLanguage() string {
	return `
🔤 <b>Вы можете изменить язык интерфейса бота.</b>
Пожалуйста, выберите язык, на котором бот будет с вами общаться.`
}
