package command

func EnCommandStart() string {
	return `
🔍 <b>Find the nearest churches!</b>
(Works with a database of over 900 churches from <b><i><a href="https://www.vsch.org">vsch.org</a></i></b>)

Just send your current coordinates or choose a location via geolocation, and the <b>bot will show all churches within your selected radius</b>.

🌟 <b>Features:</b>
→ <b>Easy church search</b> near your location
→ <b>Choose your search radius</b> <i>(5, 10, 30 km)</i>
→ <b>Church details:</b> name, denomination, distance
→ Option to <b>open the church's location</b> on the map

🚀 <b>How to use it?</b>
<b>1.</b> Send your geolocation or enter coordinates
<i>(see examples with <b>/help</b>)</i>
<b>2.</b> Choose a search radius
<b>3.</b> Get a list of nearby churches!

🔗 Add the bot and always find churches nearby: <b>@vsch_church_bot</b>`
}

func UkCommandStart() string {
	return `
🔍 <b>Знайди найближчі церкви!</b>
(Працює на базі даних церков (> 900) сайту <b><i><a href="https://www.vsch.org">vsch.org</a></i></b>)

Просто надішли свої поточні координати або вибери місце на карті, і <b>бот покаже всі церкви в обраному радіусі</b>.

🌟 <b>Можливості:</b>
→ <b>Зручний пошук церков</b> поруч із тобою
→ <b>Вибір радіусу пошуку</b> <i>(5, 10, 30 км)</i>
→ <b>Інформація про церкви:</b> назва, конфесія, відстань
→ Можливість <b>відкрити місцезнаходження церкви</b> на мапі

🚀 <b>Як користуватися?</b>
<b>1.</b> Надішли геолокацію або введи координати
<i>(приклади надсилання геолокації — <b>/help</b>)</i>
<b>2.</b> Вибери радіус пошуку
<b>3.</b> Отримай список найближчих церков!

🔗 Додай бота і завжди знаходь церкви поблизу: <b>@vsch_church_bot</b>`
}

func RuCommandStart() string {
	return `
🔍 <b>Найди ближайшие церкви!</b>
(работает по базе церквей (> 900) сайта <b><i><a href="https://www.vsch.org">vsch.org</a></i></b>)

Просто отправь свои текущие координаты или выбери местонахождение в геолокации, и <b>бот покажет все церкви в выбранном радиусе</b>.

🌟 <b>Возможности:</b>
→ <b>Удобный поиск церквей</b> рядом с тобой
→ <b>Выбор радиуса поиска</b> <i>(5, 10, 30 км)</i>
→ <b>Информация о церквях:</b> название, конфессия, расстояние
→ Возможность <b>открыть местоположение церкви</b> на карте

🚀 <b>Как использовать?</b>
<b>1.</b> Отправь данные геолокации или введи координаты
<i>(примеры отправки геолокации <b>/help</b>)</i>
<b>2.</b> Выбери радиус поиска
<b>3.</b> Получи список ближайших церквей!

🔗 Добавь бота и всегда находи церкви рядом: <b>@vsch_church_bot</b>`
}
